Revit 2016 API
TextNode.HorizontalAlignment Property
 Horizontal alignment of the text content within the text area of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public HorizontalTextAlignment HorizontalAlignment { get; }
Visual Basic
Public ReadOnly Property HorizontalAlignment As HorizontalTextAlignment
	Get
Visual C++
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace